setwd("D:/Work_R/03_∫∏∞«µ•¿Ã≈Õ")

x <-c(1009, 1280, 1180, 1255, 1547, 2352, 1956, 1080, 
      1176, 1767, 1680, 2050, 1452, 2857, 3100, 1621)

n <- length(x)
mx <-mean(x)
mx
sx<-sd(x)
sx
lbd<-mx -qt(0.975, n-1)*sx/sqrt(n)
lbd
ubd<-mx + qt(0.975, n-1)*sx/sqrt(n)
ubd

t.test(x , mu=1500, alternative = c("two.sided") )

»Ìø¨¿⁄ <- c( 16.6, 13.9, 11.3, 26.5, 17.4, 15.3,
           15.8, 12.3, 18.6, 12.0, 24.1, 16.5,
           21.8, 16.3, 23.4, 18.8 )
∫Ò»Ìø¨¿⁄ <- c(18.1, 6.0, 10.8, 11.0, 7.7,
          17.9, 8.5, 13.0, 18.9 )

»Ìø¨¿⁄ºˆ <- length(»Ìø¨¿⁄)
∫Ò»Ìø¨¿⁄ºˆ <- length(∫Ò»Ìø¨¿⁄)

»Ìø¨¿⁄∆Ú±’ <-  mean( »Ìø¨¿⁄ ) ; »Ìø¨¿⁄∆Ú±’
∫Ò»Ìø¨¿⁄∆Ú±’ <-  mean( ∫Ò»Ìø¨¿⁄ ) ; ∫Ò»Ìø¨¿⁄∆Ú±’

»Ìø¨¿⁄«•¡ÿ∆Ì¿⁄ <-  sd( »Ìø¨¿⁄ ) ; »Ìø¨¿⁄«•¡ÿ∆Ì¿⁄
∫Ò»Ìø¨¿⁄«•¡ÿ∆Ì¿⁄ <-  sd( »Ìø¨¿⁄ ) ; ∫Ò»Ìø¨¿⁄«•¡ÿ∆Ì¿⁄
sp<-sqrt( ( (»Ìø¨¿⁄ºˆ-1) * »Ìø¨¿⁄«•¡ÿ∆Ì¿⁄^2 + (∫Ò»Ìø¨¿⁄ºˆ-1) * ∫Ò»Ìø¨¿⁄«•¡ÿ∆Ì¿⁄^2 )/( »Ìø¨¿⁄ºˆ+∫Ò»Ìø¨¿⁄ºˆ-2) ) ; sp

lbd<-(»Ìø¨¿⁄∆Ú±’-∫Ò»Ìø¨¿⁄∆Ú±’) - qt(0.975, ( »Ìø¨¿⁄ºˆ+∫Ò»Ìø¨¿⁄ºˆ-2) )*sp*sqrt(1/»Ìø¨¿⁄ºˆ+1/∫Ò»Ìø¨¿⁄ºˆ)
lbd
ubd<-(»Ìø¨¿⁄∆Ú±’-∫Ò»Ìø¨¿⁄∆Ú±’) + qt(0.975, ( »Ìø¨¿⁄ºˆ+∫Ò»Ìø¨¿⁄ºˆ-2) )*sp*sqrt(1/»Ìø¨¿⁄ºˆ+1/∫Ò»Ìø¨¿⁄ºˆ)
ubd

t.test(»Ìø¨¿⁄ ,∫Ò»Ìø¨¿⁄, alternative = c("two.sided") )



before <-c(90, 56, 49, 64, 66, 88, 62, 91, 74, 93, 55, 71, 54, 65, 54 )
after <- c(72, 55, 56, 57, 62, 79, 55, 72, 73, 74, 58, 59, 58, 71, 61 )
dd <- after - before
nn<-length(dd)
md=mean(dd)
sdd=sd(dd)
t0 <-mean(dd) / ( sd(dd)/sqrt(nn) )
t0
pt(t0, nn-1)

t.test(after, before, paired = TRUE, alternative = c("less") )

